; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v4 - type_1 ?v6 - type_2)
 	      (pred_1 ?v8 - object ?v6 - type_2)
	      (pred_4 ?v4 - type_1 ?v3 - type_3)
	      (pred_3 ?v4 - type_1 ?v8 - object ?v3 - type_3))

   (:action op_1
       :parameters  (?v4 - type_1 ?v1 ?v5 - type_2)
       :precondition (and  (pred_2 ?v4 ?v1))
       :effect (and  (pred_2 ?v4 ?v5)
		     (not (pred_2 ?v4 ?v1))))

   (:action op_3
       :parameters (?v4 - type_1 ?v2 - object ?v7 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v7) (pred_2 ?v4 ?v7) (pred_4 ?v4 ?v3))
       :effect (and (pred_3 ?v4 ?v2 ?v3)
		    (not (pred_1 ?v2 ?v7)) 
		    (not (pred_4 ?v4 ?v3))))

   (:action op_2
       :parameters (?v4 - type_1 ?v2 - object ?v7 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v2 ?v3) (pred_2 ?v4 ?v7))
       :effect (and (pred_1 ?v2 ?v7)
		    (pred_4 ?v4 ?v3)
		    (not (pred_3 ?v4 ?v2 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_03 - type_1
obj_04 obj_02 - type_3
obj_08 obj_09 obj_01 - type_2
obj_05 obj_06 obj_07 - object)
(:init
(pred_2 obj_03 obj_01)
(pred_4 obj_03 obj_04)
(pred_4 obj_03 obj_02)
(pred_1 obj_05 obj_08)
(pred_1 obj_06 obj_08)
(pred_1 obj_07 obj_01)
)
(:goal
(and
(pred_1 obj_05 obj_01)
(pred_1 obj_06 obj_09)
(pred_1 obj_07 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_03 ?b obj_02))))
)
)

; plan
1. (op_1 obj_03 obj_01 obj_08)
   deleted: (pred_2 obj_03 obj_01)
   added: (pred_2 obj_03 obj_08)
   goals met: 1 of 3
2. (op_3 obj_03 obj_05 obj_08 obj_04)
   deleted: (pred_1 obj_05 obj_08) (pred_4 obj_03 obj_04)
   added: (pred_3 obj_03 obj_05 obj_04)
   goals met: 1 of 3
3. (op_1 obj_03 obj_08 obj_01)
   deleted: (pred_2 obj_03 obj_08)
   added: (pred_2 obj_03 obj_01)
   goals met: 1 of 3
4. (op_2 obj_03 obj_05 obj_01 obj_04)
   deleted: (pred_3 obj_03 obj_05 obj_04)
   added: (pred_1 obj_05 obj_01) (pred_4 obj_03 obj_04)
   goals met: 2 of 3
5. (op_1 obj_03 obj_01 obj_08)
   deleted: (pred_2 obj_03 obj_01)
   added: (pred_2 obj_03 obj_08)
   goals met: 2 of 3
6. (op_3 obj_03 obj_06 obj_08 obj_04)
   deleted: (pred_1 obj_06 obj_08) (pred_4 obj_03 obj_04)
   added: (pred_3 obj_03 obj_06 obj_04)
   goals met: 2 of 3
7. (op_1 obj_03 obj_08 obj_09)
   deleted: (pred_2 obj_03 obj_08)
   added: (pred_2 obj_03 obj_09)
   goals met: 2 of 3
8. (op_2 obj_03 obj_06 obj_09 obj_04)
   deleted: (pred_3 obj_03 obj_06 obj_04)
   added: (pred_1 obj_06 obj_09) (pred_4 obj_03 obj_04)
   goals met: 3 of 3
